<template>
  <div class="experiment experiment-content">
    <h1 class="content-title">{{name}}</h1>
    <div class="content-main" v-if="contents.length > 0">
      <Article :contents="contents"></Article>
    </div>
    <div class="content-main" v-else>
      <p class="content-empty">
        暂无数据...
      </p>
    </div>
  </div>
</template>

<script>
import Article from '../../../components/article'
export default {
  name: 'experiment-content',
  components: {
    Article
  },
  data () {
    return {
      id: 0,
      name: '',
      datas: [],
      contents: []
    }
  },
  mounted () {
    this.datas = [
      {
        id: 1,
        name: '第五版课程实验',
        contents: [
          {
            id: 0,
            name: '第五版课程实验简介',
            contents: [
              {
                name: '',
                content: '按照《数据库系统概论》第5版的内容，本课程设计了11个实验，每个实验包括若干实验项目，一共26个实验项目，其中必修实验项目12个，选修实验项目14个。',
                imgs: []
              },
              {
                name: '',
                content: '',
                imgs: [
                  {
                    imgTitle: '',
                    imgUrl: 'http://chinadb.ruc.edu.cn/Public/img/exp_5th.png',
                    imgTip: ''
                  }
                ]
              },
              {
                name: '',
                content: '实验指导部分首先介绍了数据库课程实验环境建设和实验数据准备的技术和方法；然后详细介绍了每一章的实验设置、每个实验的要求和较为详细的实验报告示例，供读者学习参考；最后介绍了数据库课程实验考核标准和实验评价方法。\n' +
                  '\n' +
                  '实验报告示例中的实验代码以国产数据库管理系统金仓数据库KingbaseES为基础，但又不局限于金仓数据库系统，实验示例代码针对其他具体的数据库管理系统稍做修改同样可以运行。',
                imgs: []
              }
            ]
          },
          {
            id: 1,
            name: '实验1：数据库定义与操作语言',
            contents: [
              {
                name: '',
                content: '数据库定义与操作语言实验包含6个实验项目（参见表4.2），其中5个必修实验项目，1个选修实验项目。其中实验项目1.1至1.5为设计型实验，1.6为验证性实验项目。',
                imgs: []
              },
              {
                name: '实验1.1 数据库定义',
                content: '（1）实验目的\n' +
                  '\n' +
                  '理解和掌握数据库DDL语言，能够熟练地使用SQL DDL语句创建、修改和删除数据库、模式和基本表。\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '理解和掌握SQL DDL语句的语法，特别是各种参数的具体含义和使用方法；使用SQL语句创建、修改和删除数据库、模式和基本表。掌握SQL语句常见语法错误的调试方法。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：创建数据库、基本表。\n' +
                  '\n' +
                  '实验难点：创建基本表时，为不同的列选择合适的数据类型，正确创建表级和列级完整性约束，如列值是否允许为空、主码和外码等。注意：数据完整性约束，可以在创建基本表时定义，也可以先创建表然后定义完整性约束；由于完整性约束的限制，被引用的表要先创建。\n' +
                  '\n',
                imgs: []
              },
              {
                name: '实验1.2 数据基本查询',
                content: '1）实验目的\n' +
                  '\n' +
                  '掌握SQL程序设计基本规范，熟练运用SQL语言实现数据基本查询，包括单表查询、分组统计查询和连接查询。\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '针对TPC-H数据库设计各种单表查询SQL语句、分组统计查询语句；设计单个表针对自身的连接查询，设计多个表的连接查询。理解和掌握SQL查询语句各个子句的特点和作用，按照SQL程序设计规范写出具体的SQL查询语句，并调试通过。\n' +
                  '\n' +
                  '说明：简单地说，SQL程序设计规范包含SQL关键字大写、表名、属性名、存储过程名等标示符大小写混合、SQL程序书写缩进排列等编程规范。具体内容参见参考文献3。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：分组统计查询、单表自身连接查询、多表连接查询。\n' +
                  '\n' +
                  '实验难点：区分元组过滤条件和分组过滤条件；确定连接属性，正确设计连接条件。',
                imgs: []
              },
              {
                name: '实验1.3 数据高级查询',
                content: '（1）实验目的\n' +
                  '\n' +
                  '掌握SQL嵌套查询和集合查询等各种高级查询的设计方法等。\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '针对TPC-H数据库，正确分析用户查询要求，设计各种嵌套查询和集合查询。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：嵌套查询。\n' +
                  '\n' +
                  '实验难点：相关子查询、多层EXIST嵌套查询。',
                imgs: []
              },
              {
                name: '实验1.4 数据更新',
                content: '（1）实验目的\n' +
                  '\n' +
                  '熟悉数据库的数据更新操作，能够使用SQL语句对数据库进行数据的插入、修改、删除操作。\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '针对TPC-H数据库设计单元组插入、批量数据插入、修改数据和删除数据等SQL语句。理解和掌握INSERT、UPDATE和DELETE语法结构的各个组成成分，结合嵌套SQL子查询，分别设计几种不同形式的插入、修改和删除数据的语句，并调试成功。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：插入、修改和删除数据的SQL。\n' +
                  '\n' +
                  '实验难点：与嵌套SQL子查询相结合的插入、修改和删除数据的SQL语句；利用一个表的数据来插入、修改和删除另外一个表的数据。',
                imgs: []
              },
              {
                name: '实验1.5 视图',
                content: '（1）实验目的\n' +
                  '\n' +
                  '熟悉SQL语言有关视图的操作，能够熟练使用SQL语句来创建需要的视图，定义数据库外模式，并能使用所创建的视图实现数据管理。\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '针对给定的数据库模式，以及相应的应用需求，创建视图、创建带WITH CHECK OPTION的视图，并验证视图WITH CHECK OPTION选项的有效性。理解和掌握视图消解执行原理，掌握可更新视图和不可更新视图的区别。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：创建视图。\n' +
                  '\n' +
                  '实验难点：可更新的视图和不可更新的视图之区别， WITH CHECK OPTION的验证。',
                imgs: []
              },
              {
                name: '实验1.6 索引',
                content: '（1）实验目的\n' +
                  '\n' +
                  '掌握索引设计原则和技巧，能够创建合适的索引以提高数据库查询、统计分析效率。\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '针对给定的数据库模式和具体应用需求，创建唯一索引、函数索引、复合索引等；修改索引；删除索引。设计相应的SQL查询验证索引有效性。学习利用EXPLAIN命令分析SQL查询是否使用了所创建的索引，并能够分析其原因，执行SQL查询并估算索引提高查询效率的百分比。要求实验数据集达到10万条记录以上的数据量，以便验证索引效果。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：创建索引。\n' +
                  '\n' +
                  '实验难点：设计SQL查询验证索引有效性。',
                imgs: []
              }
            ]
          },
          {
            id: 2,
            name: '实验2：安全性语言',
            contents: [
              {
                name: '',
                content: '安全性实验包含两个实验项目(参见表4.3)，其中1个为必修，1个为选修。自主存取控制实验为设计型实验项目，审计实验为验证型实验项目。',
                imgs: []
              },
              {
                name: '实验2.1 自主存取控制实验',
                content: '（1）实验目的\n' +
                  '\n' +
                  '掌握自主存取控制权限的定义和维护方法。\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '定义用户、角色，分配权限给用户、角色，回收权限，以相应的用户名登录数据库验证权限分配是否正确。选择一个应用场景，使用自主存取控制机制设计权限分配。可以采用两种方案。方案一：采用SYSTEM超级用户登录数据库，完成所有权限分配工作，然后用相应用户名登陆数据库以验证权限分配正确性；方案二：采用SYSTEM用户登陆数据库创建三个部门经理用户，并分配相应的权限，然后分别用三个经理用户名登陆数据库，创建相应部门的USER, ROLE，并分配相应权限。下面的实验报告示例，采用实验方案一。验证权限分配之前，请备份好数据库；针对不同用户所具有的权限，分别设计相应的SQL语句加以验证。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：定义角色，分配权限和回收权限。\n' +
                  '\n' +
                  '实验难点：实验方案二实现权限的再分配和回收。',
                imgs: []
              },
              {
                name: '*实验2.2审计实验',
                content: '（1）实验目的\n' +
                  '\n' +
                  '掌握数据库审计的设置和管理方法，以便监控数据库操作，维护数据库安全。\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '打开数据库审计开关。以具有审计权限的用户登陆数据库，设置审计权限，然后以普通用户登陆数据库，执行相应的数据操纵SQL语句，验证相应审计设置是否生效，最后再以具有审计权限的用户登陆数据库，查看是否存在相应的审计信息。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：数据库对象级审计，数据库语句级审计\n' +
                  '\n' +
                  '实验难点：合理地设置各种审计信息。一方面，为了保护系统重要的敏感数据，需要系统地设置各种审计信息，不能留有漏洞，以便随时监督系统使用情况，一旦出现问题，也便于追查；另一方面，审计信息设置过多，会严重影响数据库的使用性能，因此需要合理设置。',
                imgs: []
              }
            ]
          },
          {
            id: 3,
            name: '实验3：完整性语言',
            contents: [
              {
                name: '',
                content: '完整性语言实验包含3个实验项目（参见表4.4），其中2个必修项目，1个选修项目。该实验的各个实验项目均为验证型实验项目。',
                imgs: []
              },
              {
                name: '实验3.1 实体完整性实验',
                content: '（1）实验目的\n' +
                  '\n' +
                  '掌握实体完整性的定义和维护方法。\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '定义实体完整性，删除实体完整性。能够写出两种方式定义实体完整性的SQL语句：创建表时定义实体完整性、创建表后定义实体完整性。设计SQL语句验证完整性约束是否起作用。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：创建表时定义实体完整性。\n' +
                  '\n' +
                  '实验难点：有多个候选码时实体完整性的定义。',
                imgs: []
              },
              {
                name: '实验3.2 参照完整性实验',
                content: '（1）实验目的\n' +
                  '\n' +
                  '掌握参照完整性的定义和维护方法。\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '定义参照完整性，定义参照完整性的违约处理，删除参照完整性。写出两种方式定义参照完整性的SQL语句：创建表时定义参照完整性、创建表后定义参照完整性。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：创建表时定义参照完整性。\n' +
                  '\n' +
                  '实验难点：参照完整性的违约处理定义。',
                imgs: []
              },
              {
                name: '实验3.3 用户自定义完整性实验',
                content: '（1）实验目的\n' +
                  '\n' +
                  '掌握用户自定义完整性的定义和维护方法。\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '针对具体应用语义，选择NULL/NOT NULL、DEFAULT，UNIQUE、CHECK等，定义属性上的约束条件。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：NULL/NOT NULL, DEFAULT。\n' +
                  '\n' +
                  '实验难点：CHECK。',
                imgs: []
              }
            ]
          },
          {
            id: 4,
            name: '实验4 触发器',
            contents: [
              {
                name: '',
                content: '（1）实验目的\n' +
                  '\n' +
                  '掌握数据库触发器的设计和使用方法\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '定义BEFORE触发器和AFTER触发器。能够理解不同类型触发器的作用和执行原理，验证触发器的有效性。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：触发器的定义。\n' +
                  '\n' +
                  '实验难点：利用触发器实现较为复杂的用户自定义完整性。',
                imgs: []
              }
            ]
          },
          {
            id: 5,
            name: '实验5 数据库设计',
            contents: [
              {
                name: '',
                content: '（1）实验目的\n' +
                  '\n' +
                  '掌握数据库设计基本方法及数据库设计工具。\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '掌握数据库设计基本步骤，包括数据库概念结构设计、逻辑结构设计，物理结构设计，数据库模式SQL语句生成。能够使用数据库设计工具进行数据库设计。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：概念结构设计、逻辑结构设计。\n' +
                  '\n' +
                  '实验难点：逻辑结构设计。逻辑结构设计虽然可以按照一定的规则从概念结构转换而来，但是由于概念结构通常比较抽象，较少考虑更多细节，因此转换而成的逻辑结构还需要进一步调整和优化。逻辑结构承接概念结构和物理结构，处于核心地位，因而是数据库设计的重点，也是难点。',
                imgs: []
              }
            ]
          },
          {
            id: 6,
            name: '实验6：存储过程',
            contents: [
              {
                name: '',
                content: '存储过程实验包含3个实验项目（参见表4.7），其中2个必修实验项目，1个选修实验项目，均为设计型实验项目。',
                imgs: []
              },
              {
                name: '实验6.1 存储过程实验',
                content: '（1）实验目的\n' +
                  '\n' +
                  '掌握数据库PL/SQL编程语言，以及数据库存储过程的设计和使用方法\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '存储过程定义、存储过程运行，存储过程更名，存储过程删除，存储过程的参数传递。掌握PL/SQL编程语言和编程规范，规范设计存储过程。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：存储过程定义和运行。\n' +
                  '\n' +
                  '实验难点：存储过程的参数传递方法。',
                imgs: []
              },
              {
                name: '实验6.2 自定义函数',
                content: '（1）实验目的\n' +
                  '\n' +
                  '掌握数据库PL/SQL编程语言以及数据库自定义函数的设计和使用方法。\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '自定义函数定义、自定义函数运行，自定义函数更名，自定义函数删除，自定义函数的参数传递。掌握PL/SQL和编程规范，规范设计自定义函数。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：自定义函数的定义和运行。\n' +
                  '\n' +
                  '实验难点：自定义函数的参数传递方法。',
                imgs: []
              },
              {
                name: '实验6.3 游标实验',
                content: '（1）实验目的\n' +
                  '\n' +
                  '掌握PL/SQL游标的设计、定义和使用方法，理解PL/SQL游标按行操作和SQL按结果集操作的区别和联系。\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '游标定义、游标使用。掌握各种类型游标的特点、区别与联系。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：游标定义和使用。\n' +
                  '\n' +
                  '实验难点：游标类型。',
                imgs: []
              }
            ]
          },
          {
            id: 7,
            name: '实验7：数据库应用开发',
            contents: [
              {
                name: '',
                content: '数据库应用开发实验分为2个选修实验项目(参见表4.8)。该实验项目可以任选其一，也可以单独作为一个大作业，或者与数据库设计实验一起作为一个大作业布置给学生，让学生充分利用课外时间完成该大作业。该实验项目为综合型实验项目。',
                imgs: []
              },
              {
                name: '实验7.1 基于ODBC的数据库应用开发',
                content: '（1）实验目的\n' +
                  '\n' +
                  '掌握基于ODBC驱动的数据库应用开发方法。\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '设置ODBC驱动数据源，基于ODBC驱动的数据库连接方法，实现数据库数据操纵等应用开发常见功能。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：基于ODBC驱动的数据库连接方法、数据库数据操纵功能等。\n' +
                  '\n' +
                  '实验难点：不同的数据库应用开发工具具有不同的开发框架和模式。能够较为熟练地使用所选择的应用开发工具，是实现本实验的难点。\n' +
                  '\n',
                imgs: []
              },
              {
                name: '实验7.2 基于JDBC的数据库应用开发',
                content: '（1）实验目的\n' +
                  '\n' +
                  '掌握基于JDBC驱动的数据库应用开发方法。\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '基于JDBC驱动的数据库连接方法，实现数据库数据操纵等应用开发常见功能。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：基于JDBC驱动的数据库连接方法、数据库数据操纵功能等。\n' +
                  '\n' +
                  '实验难点：不同的数据库应用开发工具具有不同的开发框架和模式。能够较为熟练地使用所选择的应用开发工具，是实现本实验的难点。',
                imgs: []
              }
            ]
          },
          {
            id: 8,
            name: '实验8 数据库设计与应用开发大作业',
            contents: [
              {
                name: '',
                content: '（1）实验目的\n' +
                  '\n' +
                  '掌握综合运用数据库原理、方法和技术进行数据库应用系统分析、设计和开发的能力。\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '为某个部门或单位开发一个数据库应用系统，具体内容包括：对某个部门或单位业务和数据进行调查，系统分析，系统设计，数据库设计，数据库创建和数据加载，数据库应用软件开发，系统测试，系统分析设计和开发文档撰写，软件、文档和数据库提交，数据库应用系统运行演示和大作业汇报。\n' +
                  '\n' +
                  '能够针对某个部门或单位的应用需求，通过系统分析，从数据库数据和应用系统功能两方面进行综合设计，实现一个完整的数据库应用系统。同时培养团队合作精神。要求5~6位同学组成一个开发小组，每位同学承担不同角色（例如：项目管理员、DBA、系统分析员、系统设计员、系统开发员、系统测试员）。撰写系统设计和开发文档；提交系统文档、数据库应用软件和数据库。每个小组进行60分钟的报告和答辩，讲解设计方案，演示系统运行，汇报分工与合作情况。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：数据库设计，数据库应用软件开发。\n' +
                  '\n' +
                  '实验难点：综合运用系统分析与设计方法，从数据和功能两方面协调设计一个完整的数据库应用系统。熟练掌握和运用一个主流数据库应用开发工具进行数据库应用软件开发。',
                imgs: []
              }
            ]
          },
          {
            id: 9,
            name: '实验9 数据库监视与性能优化',
            contents: [
              {
                name: '实验9.1 数据库查询性能调优实验',
                content: '（1）实验目的\n' +
                  '\n' +
                  '理解和掌握数据库查询性能调优的基本原理和方法。\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '学会使用EXPLAIN命令分析查询执行计划、利用索引优化查询性能、优化SQL语句以及理解和掌握数据库模式规范化设计对查询性能的影响。能针对给定的数据库模式，设计不同的实例验证查询性能优化效果。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：利用索引优化查询性能、优化SQL语句。\n' +
                  '\n' +
                  '实验难点：数据库模式规范化设计对查询性能的影响。',
                imgs: []
              },
              {
                name: '*实验9.2 数据库性能监视实验',
                content: '（1）实验目的\n' +
                  '\n' +
                  '了解你所使用的数据库管理系统提供的数据库性能监视功能，学习数据库查询性能监视的基本原理和方法。\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '使用KingbaseES的数据库性能监视工具，通过标准统计视图和统计访问函数查看数据库系统收集到的性能统计信息、ANALYZE更新数据库统计信息、通过专门工具监视系统系性能。希望能够熟悉了解数据库系统有关性能统计信息的标准视图和统计访问函数，了解如何通过系统收集到的性能数据监视系统性能。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：通过标准统计视图和统计访问函数查看数据库系统收集到的性能统计信息。\n' +
                  '\n' +
                  '实验难点：分析性能统计信息，找出存在的性能问题。',
                imgs: []
              },
              {
                name: '*实验9.3 数据库系统配置参数调优实验',
                content: '（1）实验目的\n' +
                  '\n' +
                  '了解数据库系统级参数和连接级参数的配置和调优的基本原理和方法。了解用户可以通过修改这些参数设置，来调整系统运行时配置以优化系统性能。\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '熟悉和了解数据库各级参数的作用，以及配置。包括系统级参数配置和调优、数据库级参数配置和调优、会话(连接)级参数配置和调优。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：数据库级参数配置和调优、连接级参数配置和调优。\n' +
                  '\n' +
                  '实验难点：系统级参数配置和调优。',
                imgs: []
              }
            ]
          },
          {
            id: 10,
            name: '实验10 数据库恢复技术',
            contents: [
              {
                name: '',
                content: '数据库恢复技术实验分为2个选修实验项目(参见表4.11)。该实验项目为验证型实验项目。',
                imgs: []
              },
              {
                name: '实验10.1 事务实验',
                content: '（1）实验目的\n' +
                  '\n' +
                  '掌握数据库事务管理的基本原理，以及事务的编程方法。\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '设计几个典型的事务应用，包括显式事务、事务提交、事务回滚、隐式事务等。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：显式事务的编写。\n' +
                  '\n' +
                  '实验难点：把事务的编写和存储过程的设计与使用结合起来。',
                imgs: []
              },
              {
                name: '实验10.2 数据库备份实验',
                content: '（1）实验目的\n' +
                  '\n' +
                  '掌握数据库数据转储备份的方法。\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '了解数据转储备份的概念。学习实际使用的数据库系统（如KINGBASE）中数据库逻辑备份、物理备份 、增量备份和完全备份的概念和使用方法。利用数据库管理系统提供的备份工具实现各种数据库备份策略。\n' +
                  '\n' +
                  '说明：数据库备份也称数据库转储。 物理备份是复制数据库物理文件；逻辑备份将数据库对象的定义和数据导出到指定文件中；完全备份是备份整个数据库；增量备份是只备份上次备份以来有变化的数据。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：逻辑备份，物理备份。\n' +
                  '\n' +
                  '实验难点：增量备份。',
                imgs: []
              },
              {
                name: '实验10.3 数据库恢复实验',
                content: '（1）实验目的\n' +
                  '\n' +
                  '掌握数据库逻辑恢复和物理恢复的方法。\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '设计数据库恢复策略，实现数据库恢复，包括数据库逻辑恢复、物理恢复、增量恢复和完全恢复等。数据库恢复也称数据库还原。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：逻辑恢复，物理恢复。\n' +
                  '\n' +
                  '实验难点：增量恢复。',
                imgs: []
              }
            ]
          },
          {
            id: 11,
            name: '实验11 并发控制',
            contents: [
              {
                name: '',
                content: '（1）实验目的\n' +
                  '\n' +
                  '掌握数据库并发控制的基本原理及其应用方法。\n' +
                  '\n' +
                  '（2）实验内容和要求\n' +
                  '\n' +
                  '验证并发操作带来的数据的不一致性问题，包括丢失修改、不可重复读和读“脏”数据等情况。要求通过取消查询分析器的自动提交功能，创建两个不同的用户，分别登录查询分析器，同时打开两个客户端；通过SQL语言设计具体例子展示不同的封锁级别的应用场景，验证各种封锁级别的并发控制效果，以进一步理解封锁技术是如何解决事务并发导致的问题的。\n' +
                  '\n' +
                  '（3）实验重点和难点\n' +
                  '\n' +
                  '实验重点：并发操作带来的数据的不一致性问题。\n' +
                  '\n' +
                  '实验难点：设计具体的例子演示各种封锁级别。',
                imgs: []
              }
            ]
          }
        ]
      },
      {
        id: 3,
        name: '实验数据说明',
        contents: [
          {
            id: 0,
            contents: [
              {
                name: '',
                content: '一、dbtestdata(KingbaseES).rar 为金仓数据库管理系统KingbaseES的备份数据文件。文件解压后，按照说明文件，把tpch.dmp导入KingbaseES数据库服务器中。\n' +
                  '\n' +
                  '二、dbtestdata(CSV).rar为CSV通用格式的备份数据，可以导入其他类型的数据库服务器中。\n' +
                  '\n' +
                  '\n' +
                  '下载链接：\n' +
                  '\n' +
                  '• dbtestdata(KingbaseES).rar\n' +
                  '\n' +
                  '• dbtestdata(CSV).rar'
              }
            ]
          }
        ]
      }
    ]
    this.getData()
  },
  methods: {
    // 根据路由参数更新组件内容
    getData () {
      var {id} = this.$route.params
      // 没有子级菜单，则默认子级 id 为 0，以兼容有子级菜单
      if (id.indexOf('.') === -1) {
        id += '.0'
      }
      id = id.split('.')
      // 找父级数据
      var data = this.datas.find(item => item.id === id[0] * 1) || {}
      // 找子级数据
      var contents = data.contents.find(item => item.id === id[1] * 1) || {}
      // 有子级名则显示子级名，否则显示父级名
      if (contents.name) {
        this.name = contents.name
      } else {
        this.name = data.name || ''
      }
      contents = contents.contents || []
      // 处理文字换行
      if (contents.length) {
        contents.map(item => {
          // 判断是否已经转换过格式，未转换类型为 string ，转换过类型为 object
          if (typeof item.content === 'string') {
            item.content = item.content.split('\n').filter(item1 => item1 !== '')
          }
        })
      }
      this.contents = contents || []
    }
  },
  watch: {
    // 监听路由参数变化
    '$route': function () {
      this.getData()
    }
  }
}
</script>

<style lang="less">

</style>
