<template>
  <div class="outline outline-content">
    <h1 class="content-title">{{name}}</h1>
    <div class="content-main" v-if="contents.length > 0">
      <Article :contents="contents"></Article>
    </div>
    <div class="content-main" v-else>
      <p class="content-empty">
        暂无数据...
      </p>
    </div>
  </div>
</template>

<script>
import Article from '../../../components/article'
export default {
  name: 'outline-content',
  components: {
    Article
  },
  data () {
    return {
      id: 0,
      name: '',
      datas: [],
      contents: []
    }
  },
  mounted () {
    this.datas = [
      {
        id: 0,
        name: '教学大纲概论',
        contents: [
          {
            id: 0,
            contents: [
              {
                name: '一、课程内容概述',
                content: '数据库技术和系统已经成为信息基础设施的核心技术和重要基础。数据库技术作为数据管理的最有效的手段，极大的促进了计算机应用的发展。\n' +
                  '\n' +
                  '本课程系统讲述数据库系统的基础理论、基本技术和基本方法。数据库系统的基本概念、数据模型、关系数据库及其标准语言SQL、数据库安全性和完整性的概念和方法、关系规范化理论、数据库设计方法和步骤，数据库恢复和并发控制等事务管理基础知识，关系查询处理和查询优化等。\n' +
                  '\n' +
                  '本课程系统全面地讲述数据库系统的基础理论、基本技术和基本方法。包括：\n' +
                  '\n' +
                  '第一篇基础篇，包括绪论、关系数据库、关系数据库标准语言SQL、数据库安全性和数据库完整性，共5章；\n' +
                  '\n' +
                  '第二篇设计与应用开发篇，包括关系数据理论、数据库设计和数据库编程，共3章；\n' +
                  '\n' +
                  '第三篇系统篇，包括关系查询处理和查询优化、数据库恢复技术、并发控制和数据库管理系统，共4章；\n' +
                  '\n' +
                  '第四篇新技术篇，包括数据库技术发展概述、大数据管理、内存数据库系统和数据仓库与联机分析处理技术，共4章。',
                imgs: []
              },
              {
                name: '二、课程目标',
                content: '通过本课程学习，使学生系统地掌握数据库系统的基本原理和基本技术。要求在掌握数据库系统基本概念的基础上，能熟练使用SQL语言在某一个数据库管理系统上进行数据库操作；掌握数据库设计方法和步骤，具有设计数据库模式以及开发数据库应用系统的基本能力。',
                imgs: []
              },
              {
                name: '三、预修课程',
                content: '* 计算机程序设计方法和语言\n' +
                  '\n' +
                  '* 数据结构\n' +
                  '\n' +
                  '* 离散数学\n' +
                  '\n' +
                  '* 操作系统',
                imgs: []
              },
              {
                name: '四、课程学时安排',
                content: '',
                imgs: [
                  {
                    imgTitle: '数据库课程学时一览表',
                    imgUrl: 'http://chinadb.ruc.edu.cn/Public/img/outline_5th1.png'
                  },
                  {
                    imgTitle: '数据库实验一览表',
                    imgUrl: 'http://chinadb.ruc.edu.cn/Public/img/outline_5th2.png'
                  }
                ]
              },
              {
                name: '五、课程内容组织结构',
                content: '《数据库系统概论》第5版中第1章－第11章是计算机专业和相关专业本科生的学习内容（书中有*号的部分除外）。第12章-第16章等章节属于高级教程，供本科生选读或研究生学习使用，不在本科课程大纲范围内，教师也可以根据学生具体情况选择部分内容选讲。',
                imgs: [
                  {
                    imgTitle: '下表列出了《数据库系统概论》第5版的内容组织结构。',
                    imgUrl: 'http://chinadb.ruc.edu.cn/Public/old/img/content_5th.JPG'
                  }
                ]
              },
              {
                name: '六、参考书目',
                content: '1.王珊 萨师煊《数据库系统概论》第5版 高等教育出版社 2014年9月\n' +
                  '\n' +
                  '本书内容丰富，讲授时可根据学生及专业情况挑选本书不同章节的内容进行讲解。 例如，对于计算机专业本科学生，第2章2.5关系演算，第6章6.4模式分解可适当压缩。第12章数据库管理系统，新技术篇中的章节，主要供学生参考阅读，教师也可以根据学生具体情况选择部分内容进行讲解。\n' +
                  '\n' +
                  '2. J.D.Ullman, J Widom，A First Course in Database Systems，Pretice Hall, 1997\n' +
                  '\n' +
                  '本书是美国斯坦福大学（Stanford University） 计算机系本科生的第1门数据库课程教材。\n' +
                  '\n' +
                  '3. 王珊《数据库系统概论第五版实验指导与习题解析》高等教育出版社 2015年7月\n' +
                  '\n' +
                  '4. 与本书配套的数字课程资源发布在中国人民大学数据库系统概论精品课程教学网站：http://www.chinadb.org/ 和 高等教育出版社易课程网站 http://abook.hep.com.cn/187532 之上。',
                imgs: []
              },
              {
                name: '七、考核方式',
                content: '1．书面作业\n' +
                  '\n' +
                  '2．上机实验和课程大作业（数据库设计）\n' +
                  '\n' +
                  '3．期中闭卷笔试\n' +
                  '\n' +
                  '4．期末闭卷笔试\n' +
                  '\n' +
                  '5．总成绩=笔试成绩（60/100）+作业成绩（10/100）+上机实验和大作业成绩（30/100）',
                imgs: []
              }
            ]
          }
        ]
      },
      {
        id: 1,
        name: '第一章 绪论',
        contents: [
          {
            id: 0,
            contents: [
              {
                name: '内容概述',
                content: '阐述数据库的基本概念，介绍数据管理技术的进展情况、数据库技术产生和发展的背景，数据模型的基本概念、组成要素和主要的数据模型，简要介绍了概念模型，数据库系统的3级模式结构以及数据库系统的组成。',
                imgs: []
              },
              {
                name: '本章目标',
                content: '本章讲解的数据库基本概念和基本知识是学习后续各个章节的基础。学习本章的目的在于了解基本知识，掌握基本概念，为以后的学习打好扎实的基础。',
                imgs: []
              },
              {
                name: '重点和难点',
                content: '重点：掌握关系数据模型的相关概念、数据库系统三级模式和两层映像的体系结构、数据库系统的逻辑独立性和物理独立性等。\n' +
                  '\n' +
                  '难点：本章的难点是需要掌握数据库领域大量的基本概念。有些概念一开始接触会感到比较抽象，但不要紧，随着学习的逐渐推进，在后续章节中，这些抽象的概念会逐渐变得清晰具体起来。此外，数据模型及数据库系统的体系结构也是本章的难点。',
                imgs: []
              }
            ]
          }
        ]
      },
      {
        id: 2,
        name: '第二章 关系数据库',
        contents: [
          {
            id: 0,
            contents: [
              {
                name: '内容概述',
                content: '系统地讲解关系数据库的重要概念，并着重对关系模型进行讲解。关系模型包括关系数据结构、关系操作集合、以及关系完整性约束三个组成部分。讲解关系代数、元组关系演算和域关系演算。从具体到抽象，先讲解实际的语言ALPHA（元组关系演算语言）然后讲解抽象的元组关系演算，最后介绍QBE（域关系演算语言）。',
                imgs: []
              },
              {
                name: '本章目标',
                content: '掌握关系模型的三个组成部分及各部分所包括的主要内容；牢固掌握关系数据结构及其定义；关系的三类完整性约束的概念。为学习后面关系数据库系统打好基础。',
                imgs: []
              },
              {
                name: '重点和难点',
                content: '重点：掌握关系数据结构及其定义；关系的三类完整性约束的概念。需要举一反三的是：关系代数（包括抽象的语言及具体的语言）；关系代数中的各种运算（包括并、交、差、选择、投影、连接、除、及广义笛卡尔积等）。\n' +
                  '\n' +
                  '难点：由于关系代数较为抽象，因此在学习的过程中一定要结合具体的实例进行学习。同时，要注意把握由具体语言到抽象语言的原则，即通过对具体语言如ALPHA和QBE的学习过渡到对抽象的关系演算的把握。',
                imgs: []
              },
              {
                name: '实验内容',
                content: '实验准备：包括实验环境配置和实验数据准备两部分工作。实验环境推荐使用国产的金仓数据库管理系统KingbaseES。建议学生亲自安装金仓数据库管理系统，观察数据库安装过程，记录和理解安装配置参数，熟悉数据库管理系统的客户端图形管理工具。实验数据推荐使用TPC-H（http://www.tpc.org/tpch/）数据库模式。具体参考《数据库系统概论（第5版）实验指导与习题解析》（以下简称辅导书）的第二章实验环境建设和第三章实验数据准备。',
                imgs: []
              }
            ]
          }
        ]
      },
      {
        id: 3,
        name: '第三章 关系数据库标准语言SQL',
        contents: [
          {
            id: 0,
            contents: [
              {
                name: '内容概述',
                content: '详细介绍关系数据库语言SQL。SQL是关系数据库的标准语言。它内容十分丰富，功能非常强大。因为关系数据库系统的主要功能是通过SQL来实现的，因此讲解SQL的同时要进一步讲述关系数据库的基本概念。',
                imgs: []
              },
              {
                name: '本章目标',
                content: '牢固掌握SQL，达到举一反三的掌握SQL的功能。同时通过实践，体会面向过程的语言和SQL的区别和优点。体会关系数据库系统为数据库应用系统的开发提供良好环境，减轻用户负担，提高用户生产率的原因。',
                imgs: []
              },
              {
                name: '重点和难点',
                content: '重点：关系模型和关系数据库是《数据库系统概论》课程的重点，第3章又是重点中的重点。要熟练正确的使用SQL完成对数据库的查询、插入、删除、更新操作。在使用具体的SQL时，能有意识地和关系代数、关系演算等语言进行比较，了解他们各自的特点。\n' +
                  '\n' +
                  '难点：用SQL语言正确完成复杂查询，掌握SQL语言强大的查询功能。因此在学习过程中一定要多练习，要在安装好的数据库系统上进行实际操作，检查你的答案，你查询的结果是否正确。只有通过大量练习才能真正达到举一反三的熟练程度。',
                imgs: []
              },
              {
                name: '实验内容',
                content: '实验1 数据库定义与操作语言\n' +
                  '\n' +
                  '理解和掌握关系数据库标准SQL语言，能够熟练使用SQL语言在安装好的数据库系统下完成各种数据库操作和管理任务。包括使用SQL DDL语句创建、更改和删除数据库、模式和基本表；使用SQL查询语句完成各类查询操作（单表查询，连接查询，嵌套查询，集合查询）；使用SQL DML语句完成各类更新操作（插入数据，修改数据，删除数据）；理解视图的作用，掌握视图的创建、使用和删除等基本功能；理解和掌握索引的设计、创建、使用和维护等功能，体验索引对于大规模数据查询效率提高的效果；理解和掌握常用系统函数的使用方法。\n' +
                  '\n' +
                  '具体参考辅导书实验1.1至1.6。',
                imgs: []
              }
            ]
          }
        ]
      },
      {
        id: 4,
        name: '第四章 数据库安全性',
        contents: [
          {
            id: 0,
            contents: [
              {
                name: '内容概述',
                content: '介绍计算机以及信息安全技术标准的进展。详细讲解数据库安全性问题和实现技术。RDBMS实现数据库系统安全性的技术和方法有多种，本章讲解了用户身份鉴别、自主存取控制和强制存取控制技术、视图技术和审计技术、数据加密存储和加密传输等。讲解存取控制机制中用户权限的授权与回收，合法权限检查，数据库角色的概念和定义等。',
                imgs: []
              },
              {
                name: '本章目标',
                content: '掌握什么是数据库的安全性问题，牢固掌握数据库管理系统实现数据库安全性控制的常用方法和技术。',
                imgs: []
              },
              {
                name: '重点和难点',
                content: '重点：使用SQL中的GRANT 语句和 REVOKE 语句来实现数据库的实现自主存取控制功能。使用SQL中CREATE ROLE语句创建角色，用GRANT 语句给角色授权。掌握视图机制在数据库安全保护中的作用。\n' +
                  '\n' +
                  '难点：强制存取控制（MAC）机制中确定主体能否存取客体的存取规则，同学们要理解并掌握存取规则为什么要这样规定。',
                imgs: []
              },
              {
                name: '实验内容',
                content: '实验2 安全性语言\n' +
                  '\n' +
                  '理解和掌握如何使用关系数据库标准SQL语言中的 DCL语句实现数据库安全性，主要包括自主存取控制和审计两部分安全功能。理解和掌握自主存取控制权限的定义和维护方法，包括定义用户、定义角色、分配权限给角色、分配权限给用户和回收权限等基本功能。并要验证权限分配是否正确。\n' +
                  '\n' +
                  '掌握数据库审计的设置和管理方法，以便监控数据库操作，维护数据库安全，包括设置数据库审计开关、审计数据库对象、审计数据库语句、查看数据库审计记录，并验证审计设置是否生效。\n' +
                  '\n' +
                  '具体参考辅导书实验2.1、2.2。',
                imgs: []
              }
            ]
          }
        ]
      },
      {
        id: 5,
        name: '第五章 数据库完整性',
        contents: [
          {
            id: 0,
            contents: [
              {
                name: '内容概述',
                content: '详细讲解数据库的完整性概念。包括，什么是数据库的完整性，数据库的完整性概念与数据库的安全性概念的区别和联系，RDBMS的数据库完整性实现机制，包括实体完整性、参照完整性和用户自己定义的完整性约束的定义机制、完整性检查机制和违背完整性约束条件时RDBMS采取的预防措施。触发器的概念和在数据库完整性检查中的应用。',
                imgs: []
              },
              {
                name: '本章目标',
                content: '掌握什么是数据库的完整性，掌握用SQL语言定义关系模式的完整性约束条件，以及学会用断言和触发器技术实现较复杂的完整性约束。',
                imgs: []
              },
              {
                name: '重点和难点',
                content: '重点：牢固掌握DBMS完整性控制机制的三个方面，即完整性约束条件的定义、完整性约束条件的检查和违约反应。需要举一反三的：用SQL语言定义关系模式的完整性约束条件。包括定义每个模式的主码；定义参照完整性；定义与应用有关的完整性。\n' +
                  '\n' +
                  '难点：RDBMS如何实现完整性的策略，即当操作违反实体完整性、参照完整性和用户定义的完整性约束条件时，RDBMS如何进行处理，以确保数据的正确与有效。其中比较复杂的是参照完整性的实现机制。',
                imgs: []
              },
              {
                name: '实验内容',
                content: '实验3 数据库完整性语言\n' +
                  '\n' +
                  '在安装好的数据库系统下对已经建立的数据库使用SQL语言对数据进行完整性控制掌握实体完整性和参照完整性的定义、修改、删除等各种基本功能。掌握创建表时定义完整性和创建表后定义实体完整性两种方法，并能够设计SQL语句验证完整性约束是否起作用，即设计违约操作，用实验证实，当操作违反了完整性约束条件时，系统是如何进行违约处理的。\n' +
                  '\n' +
                  '实验4 触发器\n' +
                  '\n' +
                  '理解和掌握利用触发器实现较为复杂的用户自定义完整性约束的机制和方法。理解和掌握数据库触发器的分类，了解和掌握各类数据库触发器的设计和使用方法，包括创建、使用、删除、激活等各种基本功能，并能设计和执行相应的SQL语句验证触发器的有效性。\n' +
                  '\n' +
                  '具体参考辅导书实验3.1、3.2、3.3和实验4.1。',
                imgs: []
              }
            ]
          }
        ]
      },
      {
        id: 6,
        name: '第六章 关系数据理论',
        contents: [
          {
            id: 0,
            contents: [
              {
                name: '内容概述',
                content: '详细讲解关系数据理论，主要是关系数据库规范化理论。包括关系数据库逻辑设计可能出现的问题，数据依赖的基本概念（包括，函数依赖、平凡函数依赖、非平凡的函数依赖、部分函数依赖、完全函数依赖、传递函数依赖的概念；码、候选码、外码的概念和定义；多值依赖的概念），范式的概念、1NF、2NF、3NF、BCNF、4NF的概念和判定方法。数据依赖的Armstrong公理系统。本章内容分为基本要求部分（《概论》6.1-6.3）和高级部分（《概论》6.4）。前者是计算机大学本科学生应该掌握的内容。后者是研究生应该学习掌握的内容。',
                imgs: []
              },
              {
                name: '本章目标',
                content: '关系数据理论既是关系数据库的重要理论基础也是数据库逻辑设计的理论指南和有力工具。要掌握规范化理论和优化数据库模式设计的方法。',
                imgs: []
              },
              {
                name: '重点和难点',
                content: '重点：了解什么是一个"不好"的数据库模式。什么是模式的插入异常和删除异常。规范化理论的重要意义。牢固掌握数据依赖的基本概念，范式的概念，从1NF到4NF的定义，规范化的含义和作用。需要举一反三的：四个范式的理解与应用，各个级别范式中存在的问题（插入异常、删除异常、数据冗余）和解决方法。\n' +
                  '\n' +
                  '难点：能够根据应用语义，完整地写出关系模式的数据依赖集合，并能根据数据依赖分析某一个关系模式属于第几范式。各个级别范式的关系及其证明。 本章内容的理论性较强。要通过具体例子和习题练习理解和掌握理论知识。',
                imgs: []
              }
            ]
          }
        ]
      },
      {
        id: 7,
        name: '第七章 数据库设计',
        contents: [
          {
            id: 0,
            contents: [
              {
                name: '内容概述',
                content: '讲解数据库设计方法和技术。主要讨论数据库设计的特点，数据库设计的基本步骤，数据库设计过程中数据字典的内容，数据库设计各个阶段的设计目标、、方法等。其中重点是概念结构的设计和逻辑结构的设计，这也是数据库设计过程中最重要的两个环节。\n' +
                  '\n' +
                  '概念结构的设计着重介绍了E-R模型的基本概念和图示方法。应重点掌握实体型、属性和联系的概念，理解实体型之间的一对一、一对多和多对多联系。掌握E-R模型的设计以及把E-R模型转换为关系模型的方法。 学习本章要努力掌握书中讨论的基本方法，还要能在实际工作中运用这些思想设计符合应用需求的数据库模式和数据库应用系统。\n' +
                  '\n' +
                  '本章内容的实践性较强，教师可以少讲，让学生多读书并进行实践。',
                imgs: []
              },
              {
                name: '本章目标',
                content: '了解数据库设计的重要性和数据库设计在信息系统开发和建设中的核心地位。掌握数据库设计方法和步骤，使学生具有设计数据库模式以及开发数据库应用系统的基本能力，能在实际工作中运用这些知识、技术和方法，设计符合应用需求的数据库及其应用系统。',
                imgs: []
              },
              {
                name: '重点和难点',
                content: '重点：掌握数据库设计步骤和数据库设计过程中的各级模式设计方法。特别是数据库概念结构的设计和逻辑结构的设计，这是数据库设计过程中最重要的两个环节。牢固掌握用E-R图来表示概念模型的方法，掌握E-R图的设计，E-R图向关系模型的转换。\n' +
                  '\n' +
                  '难点：技术上的难点是E-R图的设计和数据模型的优化，包括对现实世界进行抽象的能力，提取实体、属性、实体型之间的联系，正确划分实体与属性的能力。如何把第6章关系数据理论与本章结合，用关系数据理论指导数据库的逻辑设计。真正的难点是理论与实际的结合。\n' +
                  '\n' +
                  '同学们一般缺乏实际经验，缺乏对实际问题解决的能力。特别是缺乏应用领域的知识。而数据库设计需要设计人员对应用环境、专业业务有具体深入的了解，这样才能设计出符合具体领域要求的数据库及其应用系统。\n' +
                  '\n' +
                  '因此，要在完成本章习题的基础上认真完成大作业。体会这些要点，从而真正掌握本章讲解的知识、方法和技术。',
                imgs: []
              },
              {
                name: '课程大作业 《数据库设计与应用开发》',
                content: '数据库设计和应用开发实验是一个大的实验项目，一共包括4个实验，即实验5、实验6，实验7和实验8。\n' +
                  '\n' +
                  '实验5针对第7章数据库设计中数据库概念设计、逻辑设计和物理设计等内容进行实验。实验6和实验7针对第8章内容，实验8则是一个综合性的数据库设计与应用开发大作业。\n' +
                  '\n' +
                  '实验5 数据库设计\n' +
                  '\n' +
                  '掌握数据库设计基本方法和基本步骤，包括数据库概念结构设计、逻辑结构设计和物理结构设计。能够利用一种数据库设计工具自动生成数据库模式SQL语句，能够在数据库管理系统中执行相应的SQL语句，创建所设计的数据库。\n' +
                  '\n' +
                  '具体参考辅导书实验5.1。',
                imgs: []
              }
            ]
          }
        ]
      },
      {
        id: 8,
        name: '第八章 数据库编程',
        contents: [
          {
            id: 0,
            contents: [
              {
                name: '内容概述',
                content: '在数据库应用系统的开发中常常使用编程方法对数据库进行操纵。本章讲解这些编程技术涉及的概念和使用的方法，主要包括嵌入式SQL、游标的概念；SQL的过程化扩展PL/SQL、存储过程和自定义函数；ODBC的工作原理和工作流程；因为JDBC编程、OLEDB编程与ODBC编程的思路基本相同，限于篇幅十分简要地讲解了JDBC和OLEDB编程。学生可以通过上机实验了解这些技术。本章内容的实践性较强，教师可以少讲，让学生多读书并进行上机实践。',
                imgs: []
              },
              {
                name: '本章目标',
                content: '掌握开发数据库应用系统的各种编程方法，具有正确选择不同的方法和技术开发应用程序的能力。',
                imgs: []
              },
              {
                name: '重点和难点',
                content: '重点：了解SQL编程技术可以有效克服SQL实现复杂应用方面的不足，提高应用系统和RDBMS间的互操作性。掌握嵌入SQL中游标的概念和使用方法；掌握PL/SQL和存储过程的基本概念，基本结构，语句语法和用法。了解使用ODBC开发应用系统的体系结构，掌握ODBC API和ODBC的应用程序的工作流程。\n' +
                  '\n' +
                  '难点：理论联系实际，能够在实际安装的RDBMS上通过编程的方式开发应用程序，完成对数据库的各种操作。能够使用ODBC来进行数据库应用程序的设计，使设计的应用系统可移植性好，并且能同时访问不同的数据库，共享数据资源。',
                imgs: []
              },
              {
                name: '实验内容',
                content: '实验6 存储过程\n' +
                  '\n' +
                  '掌握数据库存储过程和自定义函数的设计和使用方法。包括存储过程定义、存储过程运行，存储过程更名，存储过程删除，存储过程的参数传递；自定义函数定义、自定义函数运行，自定义函数更名，自定义函数删除，自定义函数的参数传递。 具体参考辅导书实验6.1、6.2。\n' +
                  '\n' +
                  '实验7 数据库应用开发\n' +
                  '\n' +
                  '理解和掌握几种主要的数据库应用开发接口（如ODBC、OLE DB和JDBC等）的基本原理和方法，至少能够使用一种数据库应用开发工具完成基本的数据库应用开发任务，包括配置数据库连接接口、连接数据库、操纵数据库数据（如插入、修改、删除和查询等）、关闭数据库连接等。 数据库应用开发实验分为2个实验项目，即实验7.1基于ODBC的数据库应用开发和实验7.2基于JDBC的数据库应用开发。2个实验项目可以任选其一，或者与实验8大作业一起，作为大作业的一部分完成。\n' +
                  '\n' +
                  '实验8 数据库设计与应用开发大作业\n' +
                  '\n' +
                  '本实验综合运用数据库设计原理、方法和技术，为某个部门或单位开发一个数据库应用系统。能够针对某个部门或单位的应用需求，通过系统分析，从数据库数据和应用系统功能两方面进行综合设计，实现一个完整的数据库应用系统。同时培养团队合作精神，要求5～6位同学组成一个开发小组，每位同学承担不同角色（例如：项目管理员、数据库管理员、系统分析员、系统设计员、系统开发员、系统测试员）。撰写系统设计和开发文档；提交系统文档、数据库应用软件和数据库。每个小组进行60分钟的报告和答辩，讲解设计方案，演示系统运行，汇报分工与合作情况。',
                imgs: []
              }
            ]
          }
        ]
      },
      {
        id: 9,
        name: '第九章 关系查询处理和查询优化',
        contents: [
          {
            id: 0,
            contents: [
              {
                name: '内容概述',
                content: '通过实例讲解关系数据库查询优化的重要性和可能性。讲解RDBMS的查询处理步骤，即查询分析、查询检查、查询优化和查询执行；查询优化的基本概念，查询优化包括代数优化和物理优化；代数优化是指关系代数表达式的优化；物理优化则是指存取路径和底层操作算法的选择，所以先讲解实现查询操作的主要算法，主要是选择操作和连接操作的主要算法思想，然后讲解关系代数表达式等价变换规则，关系代数表达式的优化，物理优化方法（基于启发式规则的存取路径选择优化，操作算法的执行代价估算方法，基于代价的优化方法）。',
                imgs: []
              },
              {
                name: '本章目标',
                content: '本章并不要求学生掌握RDBMS查询处理和查询优化的内部实现技术，因此没有详细讲解技术细节。 本章的目的是希望学生了解RDBMS查询处理的基本步骤，查询优化的概念、基本方法和技术，为数据库应用开发中利用查询优化技术提高查询效率和系统性能打下基础。',
                imgs: []
              },
              {
                name: '重点和难点',
                content: '重点：了解关系数据库查询优化的重要性。掌握查询处理各个步骤的主要功能。能够把SQL语句转换成查询树，对查询树进行代数优化，转换成优化的查询树。掌握物理优化的基本方法。\n' +
                  '\n' +
                  '难点：能运用本章学习的查询优化知识，对于比较复杂的查询，尤其是涉及连接和嵌套的查询，写出适合RDBMS自动优化的SQL语句。对于RDBMS不能优化的查询需要重写查询语句，进行手工调整以优化性能。不要把优化的任务全部放在RDBMS上。',
                imgs: []
              },
              {
                name: '实验内容',
                content: '实验9 数据库监视与性能优化\n' +
                  '\n' +
                  '理解和掌握数据库监视与性能优化的基本原理和方法。掌握数据库性能调优的方法，包括使用EXPLAIN命令分析查询执行计划、利用索引优化查询性能、优化SQL语句。\n' +
                  '\n' +
                  '本章实验需要了解你安装使用的RDBMS的查询优化方法和查询计划表示，能够利用它分析查询语句的实际执行方案和查询代价，进而通过建立索引或者修改SQL语句来降低查询代价，达到优化系统性能的目标。\n' +
                  '\n' +
                  '理解和掌握数据库模式规范化设计对查询性能的影响，并能针对给定的数据库模式设计不同的实例验证查询性能优化效果。\n' +
                  '\n' +
                  '具体参考辅导书实验9.1数据库查询性能调优实验，实验9.2数据库性能监视实验，实验9.3数据库系统配置参数调优实验。',
                imgs: []
              }
            ]
          }
        ]
      },
      {
        id: 10,
        name: '第十章 数据库恢复技术',
        contents: [
          {
            id: 0,
            contents: [
              {
                name: '内容概述',
                content: '事务处理技术主要包括数据库恢复技术和并发控制技术。因为事务是数据库恢复和并发控制的基本单位，所以首先讲解事务的基本概念和事务的ACID性质。\n' +
                  '\n' +
                  '本章讲解数据库恢复技术。包括数据库运行中可能发生的故障类型，数据库恢复中最经常使用的技术—数据转储和登录日志文件。讲解日志文件的内容及作用，登记日志文件所要遵循的原则，针对事务故障、系统故障和介质故障等不同故障的恢复策略和恢复方法。具有检查点的恢复技术。数据库镜像功能。',
                imgs: []
              },
              {
                name: '本章目标',
                content: '掌握事务的基本概念和事务的ACID性质。了解数据库恢复技术的重要性，针对不同的故障类型，掌握恢复数据库的策略和方法。',
                imgs: []
              },
              {
                name: '重点和难点',
                content: '重点：牢固掌握事务的基本概念和事务的ACID性质。要掌握数据库故障恢复的策略和方法。数据库恢复的基本原理是数据备份，它貌似简单，实际却很复杂。数据库的事务管理策略（不仅有数据库恢复策略，还有并发控制策略）和DBMS缓冲区管理策略、事务一致性级别密切相关，同学们要在学习完这些知识后把这些问题联系起来，提升对这些技术的理解和掌握。\n' +
                  '\n' +
                  '难点：对于刚刚学习数据库的学生来讲并不体会数据库故障恢复的复杂性和重要性。掌握日志文件的使用，系统故障、介质故障的恢复方法。在实际工作中，则必须正确了解所用的DBMS产品提供的恢复技术和恢复方法，并且能够根据这些机制正确制定系统的恢复策略，以保证数据库系统7*24小时正确运行。保证数据库系统在遇到故障时能及时恢复正常运行，提高抗故障抗灾难的能力。',
                imgs: []
              },
              {
                name: '实验内容',
                content: '实验10 数据库恢复技术\n' +
                  '\n' +
                  '掌握和使用数据库事务管理原理以及事务编程方法，包括显式事务定义、事务提交和回滚。掌握数据库备份原理和方法，能够利用数据库管理系统提供的备份工具实现各种数据库备份策略。掌握数据库恢复原理和方法，能够利用数据库管理系统提供的恢复工具实现各种数据库恢复策略。\n' +
                  '\n' +
                  '具体参考辅导书实验10.1事务实验，实验10.2数据库备份实验，实验10.3数据库恢复实验。',
                imgs: []
              }
            ]
          }
        ]
      },
      {
        id: 11,
        name: '第十一章 并发控制',
        contents: [
          {
            id: 0,
            contents: [
              {
                name: '内容概述',
                content: '数据库管理系统必须提供并发控制机制来协调并发用户的并发操作以保证并发事务的隔离性和一致性，保证数据库的一致性。本章讨论数据库并发控制的基本概念和实现技术。包括封锁技术、封锁协议、活锁和死锁的概念、并发调度的可串行性、冲突可串行化调度、两段锁协议、封锁的粒度、意向锁。作为选读内容，本章还简要介绍了时间戳方法，乐观控制法和多版本并发控制等其他并发控制方法。',
                imgs: []
              },
              {
                name: '本章目标',
                content: '了解的数据库并发控制技术的必要性和重要性。牢固掌握并发控制的基本概念。',
                imgs: []
              },
              {
                name: '重点和难点',
                content: '重点：掌握并发操作产生的数据不一致性（丢失修改、不可重复读、读“脏数据”）的确切含义。封锁协议与数据一致性的关系；并发调度的可串行性概念。\n' +
                  '\n' +
                  '难点：两段锁协议与串行性的关系、与死锁的关系。具有意向锁的多粒度封锁方法的封锁过程。\n' +
                  '\n' +
                  '本章内容有一定的深度和难度，可以通过对实例的学习和习题的练习来正确理解和掌握基本概念。',
                imgs: []
              },
              {
                name: '实验内容',
                content: '实验11 并发控制实验\n' +
                  '\n' +
                  '掌握数据库并发控制封锁技术的原理和应用方法。实验内容包括验证并发操作带来的数据的不一致性问题，如丢失修改、不可重复读和读“脏”数据等情况。\n' +
                  '\n' +
                  '通过取消查询分析器的自动提交功能，创建2个或多个不同的用户，分别登录查询分析器，同时打开多个客户端，通过SQL语言设计具体例子展示各种封锁级别的应用场景，验证各种封锁级别的并发控制效果，以进一步理解封锁技术是如何解决事务并发导致的问题。',
                imgs: []
              }
            ]
          }
        ]
      }
    ]
    this.getData()
  },
  methods: {
    // 根据路由参数更新组件内容
    getData () {
      var {id} = this.$route.params
      // 没有子级菜单，则默认子级 id 为 0，以兼容有子级菜单
      if (id.indexOf('.') === -1) {
        id += '.0'
      }
      id = id.split('.')
      // 找父级数据
      var data = this.datas.find(item => item.id === id[0] * 1) || {}
      // 找子级数据
      var contents = data.contents.find(item => item.id === id[1] * 1) || {}
      // 有子级名则显示子级名，否则显示父级名
      if (contents.name) {
        this.name = contents.name
      } else {
        this.name = data.name || ''
      }
      contents = contents.contents || []
      // 处理文字换行
      if (contents.length) {
        contents.map(item => {
          // 判断是否已经转换过格式，未转换类型为 string ，转换过类型为 object
          if (typeof item.content === 'string') {
            item.content = item.content.split('\n').filter(item1 => item1 !== '')
          }
        })
      }
      this.contents = contents || []
    }
  },
  watch: {
    // 监听路由参数变化
    '$route': function () {
      this.getData()
    }
  }
}
</script>

<style lang="less">

</style>
