<template>
  <div class="about about-content">
    <h1 class="content-title">{{name}}</h1>
    <div class="content-main" v-if="contents.length > 0">
      <Introduce :contents="contents" v-if="contents[0].img"></Introduce>
      <Article :contents="contents[0].contents" v-else></Article>
    </div>
    <div class="content-main" v-else>
      <p class="content-empty">
        暂无数据...
      </p>
    </div>
  </div>
</template>

<script>
import Introduce from '../../../components/introduce'
import Article from '../../../components/article'
export default {
  name: 'about-content',
  components: {
    Article,
    Introduce
  },
  data () {
    return {
      name: '',
      datas: [],
      contents: []
    }
  },
  mounted () {
    this.datas = [
      {
        id: 1,
        name: '团队简介',
        contents: [
          {
            name: '王珊',
            img: 'http://chinadb.ruc.edu.cn/Public/img/1wang.png',
            contents: [
              {
                name: '',
                content: '中国人民大学教授、博士生导师。现任大数据管理与分析方法研究北京市重点实验室（中国人民大学）学术委员会主任。曾任数据工程与知识工程教育部重点实验室学术委员会副主任，中国人民大学信息学院院长，中国计算机学会副理事长，中国计算机学会数据库专委会主任，教育部第五届科学技术委员会委员等。\n' +
                  '\n' +
                  '      自1981年以来一直从事数据库方向的教学、科研和系统开发工作。1984—1986年应邀赴美国马里兰大学工作，设计和开发可扩展的关系数据库管理系统XDB。回国后主持和承担了国家科技攻关项目、863高科技计划项目、北京市科技计划重大项目、国家自然科学基金重点及重大项目、国家核高基科技重大专项等50多项科研项目。在国内外杂志发表论文300余篇，出版数据库方面的著作30多部。\n' +
                  '\n' +
                  '      30多年来培养博士硕士研究生130余名，主持研制和开发了多个具有自主版权的数据库管理系统。科研成果曾获多项国家级和省部级科技进步奖；编著的教材曾获国家级优秀教材奖，相应课程被评为国家级精品资源共享课；曾获全国五一劳动奖章以及全国优秀教师、国家教学名师等荣誉称号。'
              }
            ]
          },
          {
            name: '萨师煊',
            img: 'http://chinadb.ruc.edu.cn/Public/img/2sa.png',
            contents: [
              {
                name: '',
                content: '（1922-2010），中国人民大学教授，我国最早从事数据库教学和科研的专家之一，中国数据库学科的奠基人。在国内率先设立了数据库系统课程，发表了多篇论文和多部著作。历任中国人民大学信息系主任、中国计算机学会常务理事及中国计算机学会数据库学组组长等职务。\n' +
                  '\n' +
                  '      我国数据库学术活动的倡导者和领导者，对我国数据库技术的发展、应用和学术交流起了重要的推动作用，对我国数据库技术跟踪国际前沿、缩短与发达国家的差距做出了很大贡献。\n' +
                  '\n'
              }
            ]
          }
        ]
      },
      {
        id: 2,
        name: '课程简介',
        contents: [
          {
            name: '',
            img: '',
            contents: [
              {
                name: '一、课程指导思想与定位',
                content: '数据库技术是计算机科学技术中发展最快的领域之一，也是应用最广的技术之一。数据库技术是计算机科学的重要分支，数据库技术和数据库系统已经成为计算机信息系统的核心技术和重要基础。\n' +
                  '\n' +
                  '《数据库系统概论》是本科计算机专业和信息系统信息管理等相关专业的专业主干课程，是数据库系统的第一门课程。',
                imgs: []
              },
              {
                name: '二、课程目标',
                content: '通过本课程学习，使学生系统地掌握数据库系统的基本原理和基本技术。要求在掌握数据库系统基本概念的基础上，能熟练使用SQL语言在某一个数据库管理系统上进行数据库操作；掌握数据库设计方法和步骤，具有设计数据库模式以及开发数据库应用系统的基本能力。',
                imgs: []
              },
              {
                name: '三、课程内容概述',
                content: '本课程系统讲述数据库系统的基础理论、基本技术和基本方法。内容包括：\n' +
                  '\n' +
                  '数据库基础篇：\n' +
                  '\n' +
                  '数据库系统的基本概念、数据模型、关系数据库及其标准语言SQL；\n' +
                  '\n' +
                  '数据库安全性和完整性的概念和方法；\n' +
                  '\n' +
                  '数据库设计与应用开发篇：\n' +
                  '\n' +
                  '关系数据理论、数据库设计和数据库编程；\n' +
                  '\n' +
                  '数据库系统篇：\n' +
                  '\n' +
                  '关系查询处理和查询优化、数据库恢复技术、并发控制等事务管理基础知识；',
                imgs: []
              },
              {
                name: '四、课程实验',
                content: '《数据库系统概论》课程具有实践性强的特点。本课程在学习过程中，始终要把实验放在重要地位，深化学生对书本知识的理解和认识，提高实际应用能力，让实践教学贯穿于整个课程教学的始终。\n' +
                  '\n' +
                  '1） 课后除了布置书本练习题外还根据课程教材的内容设计了数据库安装、交互式SQL、数据库安全性和完整性、SQL编程、查询优化等9个实验，要完成实验并提交报告。\n' +
                  '\n' +
                  '2） 1个大作业（需要小组完成）。\n' +
                  '\n' +
                  '数据库设计这一章时，将学生分组，让学生模拟不同的角色（系统分析人员、数据库设计人员、应用开发人员等），分工协作，共同完成一个小型（模拟）的数据库应用系统的设计和实现，并提交数据库设计的相关文档。\n' +
                  '\n' +
                  '帮助学生消化理论知识，培养自主学习能力、动手能力和团队合作精神。',
                imgs: []
              },
              {
                name: '五、课程教材、参考书目和学习资源',
                content: '1. 王珊 萨师煊《数据库系统概论》第5版 高等教育出版社 2014年9月\n' +
                  '\n' +
                  '本书系统全面地阐述了数据库系统的基础理论、基本技术和基本方法。全书分为4篇16章。第一篇基础篇，包括绪论、关系数据库、关系数据库标准语言SQL、数据库安全性和数据库完整性，共5章；第二篇设计与应用开发篇，包括关系数据理论、数据库设计和数据库编程，共3章；第三篇系统篇，包括关系查询处理和查询优化、数据库恢复技术、并发控制和数据库管理系统，共4章；第四篇新技术篇，包括数据库技术发展概述、大数据管理、内存数据库系统和数据仓库与联机分析处理技术，共4章。\n' +
                  '\n' +
                  '2. J.D.Ullman, J Widom，A First Course in Database Systems，Pretice Hall, 1997\n' +
                  '\n' +
                  '本书是美国斯坦福大学（Stanford University）计算机系本科生的第1门数据库课程教材。\n' +
                  '\n' +
                  '3. 王珊 张俊《数据库系统概论（第5版）实验指导和习题解析》高等教育出版社 2015年5月\n' +
                  '\n' +
                  '本书是《数据库系统概论》（第五版）一书的习题解析和实验指导教辅用书。 本书分为3部分，第1部分是每章基本知识点的讲解、习题解析、补充习题及其解答，第2部分是数据库实验指导；第3部分是3个附录，包括SQL语言实验常见问题解答、数据库领域三位图灵奖获得者的介绍、数据库基准测试TPC-C和TPC-H介绍等。 本书是应广大读者和出版社的要求，为了配合《数据库系统概论》（第5版）课程的学习而编写的。通过本书的习题和实验的综合练习，读者可以加深对数据库系统基本概念的理解，对基本知识的掌握、对基本技术的运用，以及实际应用数据库系统的能力。 本书可以作为高等学校计算机有关专业“数据库系统”课程参考书，特别是可以作为《数据库系统概论》（第5版）一书的教学辅导资料。\n' +
                  '\n' +
                  '4. 中国人民大学 数据库系统概论精品课程教学网站：http://www.chinadb.org/',
                imgs: []
              }
            ]
          }
        ]
      },
      {
        id: 3,
        name: '团队简介',
        contents: [
          {
            name: '',
            img: 'http://chinadb.ruc.edu.cn/Public/old/img/left.gif',
            contents: [
              {
                name: '课件制作：',
                content: '广东海洋大学数学与计算机学院'
              },
              {
                name: '课件组：',
                content: '总负责人： 王珊\n' +
                  '\n' +
                  '课件编导： 陈红\n' +
                  '\n' +
                  '教学指导： 王珊 陈红 杜小勇\n' +
                  '\n' +
                  '动画设计： 蔡春丽 康冠男 陈渝\n' +
                  '\n' +
                  '网站维护： 焦敏 周小明\n' +
                  '\n' +
                  '技术支持： 焦敏'
              },
              {
                name: '联系方式：',
                content: '联系地址：广东海洋大学\n' +
                  '\n' +
                  '邮编：524088\n' +
                  '\n' +
                  '电话：0759-2382101\n' +
                  '\n' +
                  'Email： xzb@gdou.edu.cn'
              }
            ]
          }
        ]
      }
    ]
    this.getData()
  },
  methods: {
    // 根据路由参数更新组件内容
    getData () {
      var {id} = this.$route.params
      var contents = this.datas.find(item => item.id === id * 1) || {}
      this.name = contents.name || ''
      contents = contents.contents || []
      // 处理文字换行
      if (contents.length) {
        contents.map(item => {
          // 判断是否已经转换过格式，未转换类型为 string ，转换过类型为 object
          if (item.contents.length) {
            item.contents.map(item1 => {
              if (typeof item1.content === 'string') {
                item1.content = item1.content.split('\n').filter(item2 => item2 !== '')
              }
            })
          }
        })
      }
      this.contents = contents || []
    }
  },
  watch: {
    // 监听路由参数变化
    '$route': function () {
      this.getData()
    }
  }
}
</script>

<style lang="less">

</style>
